
#itr:どこの値を参照すべきかのイテレータ、書き込んだらインクリメント
#ANGS:前ベクトルからの角度 STD_D:基準点からの距離 D:前の点との距離
#JCT:分岐点 BP:戻る点の情報、実行時に追加される REST:残りの部分、JCTと対応

class Sagittarius:
    def __init__(self):
        self.SGT5 = {"itr":0,
                     "ANGS":[48.5], "STD_D":[5.14], "D":[1.41], "STD_A":[131],
                     "JCT":[], "BP":[], "REST":[], "N":4
                    }
        self.SGT4 = {"itr":0,
                     "ANGS":[123.1, 27.85, 37.55],
                     "STD_D":[3.76, 3.89, 4.874],
                     "D":[1.93, 1.907, 1.139],
                     "STD_A":[170.8, 143, 179],
                     "JCT":[0], "BP":[], "REST":[self.SGT5], "N":4
                    }
        self.SGT3 = {"itr":0,
                     "ANGS":[128, 15.17],
                     "STD_D":[3.76, 4.9],
                     "D":[0.59, 1.22],
                     "STD_A":[33.5, 18.3],
                     "JCT":[], "BP":[], "REST":[], "N":4
                    }
        self.SGT2 = {"itr":0,
                     "ANGS":[65.5, 96.3],#64.5
                     "STD_D":[3.49, 3.89],
                     "D":[2.13, 0.78],
                     "STD_A":[0.26, 94], #94やばいかも
                     "JCT":[0], "BP":[], "REST":[self.SGT3], "N":4
                    }
        self.SGT = {"itr":0,
                    "ANGS":[85, 47, 37, 29],
                    "STD_D":[1.66, 1.97, 3.69, 5.88],
                    "D":[1.25, 0.905, 1.75, 2.37],
                    "STD_A":[85, 133, 96, 66],
                    "JCT":[0, 2], "BP":[], "REST":[self.SGT2, self.SGT4], "N":4
                   }
                
    
    def get(self):
        return self.SGT

    def get_name(self):
        return "SGT"

class Perseus:
    def __init__(self):
        self.PRS3 = {"itr":0,
                     "ANGS":[122.2, 14.5, 27.9, 33.7, 40.3, 17.5, 88.2],
                     "STD_D":[4.6, 4.32, 3.59, 4.33, 6.05, 7.68, 7.64],
                     "D":[2.49, 1.1, 1.78, 1.44, 1.74, 1.65, 0.87],
                     "JCT":[], "BP":[], "REST":[], "N":10
                    }
        self.PRS2 = {"itr":0,
                     "ANGS":[60.3, 70.9],
                     "STD_D":[5.3, 9.4],
                     "D":[1.35, 4.75],
                     "JCT":[], "BP":[], "REST":[], "N":10
                    }
        self.PRS = {"itr":0,
                    "ANGS":[90.9, 37, 22.3, 21.9, 13.3, 73.9, 38.8, 52, 40.2, 66.3],
                    "STD_D":[1.13, 1.98, 2.27, 2.85, 4.19, 4.75, 5.49, 5.7, 6.58, 7.49],
                    "D":[0.5, 1.8, 0.48, 1.08, 1.96, 0.7, 1.62, 3.78, 0.88, 1.18],
                    "JCT":[4, 6], "BP":[], "REST":[self.PRS2, self.PRS3], "N":10
                   }
    def get(self):
        return self.PRS

    def get_name(self):
        return "PRS"