
#itr:どこの値を参照すべきかのイテレータ、書き込んだらインクリメント
#ANGS:角度 STD_D:基準点からの距離 D:前の点との距離

class Sagittarius:
    SGT5 = {"itr":0,
        "ANGS":[48.5], "STD_D":[5.14], "D":[1.41],
        "JCT":[], "BP":[], "REST":[]
        }
    SGT4 = {"itr":0,
            "ANGS":[123.1, 27.85, 37.55],
            "STD_D":[3.76, 3.89, 4.874],
            "D":[1.93, 1.907, 1.139],
            "JCT":[0], "BP":[], "REST":[SGT5]
        }
    SGT3 = {"itr":0,
            "ANGS":[128, 15.17],
            "STD_D":[3.76, 4.9],
            "D":[0.59, 1.22],
            "JCT":[], "BP":[], "REST":[]
        }
    SGT2 = {"itr":0,
            "ANGS":[64.5, 96.3],
            "STD_D":[3.49, 3.89],
            "D":[2.13, 0.78],
            "JCT":[0], "BP":[], "REST":[SGT3]
        }
    SGT = {"itr":0,
            "ANGS":[85, 47, 37, 29],
            "STD_D":[1.66, 1.97, 3.69, 5.88],
            "D":[1.25, 0.905, 1.75, 2.37],
            "JCT":[0, 2], "BP":[], "REST":[SGT2, SGT4]
        }
    
    def get(self):
        return Sagittarius.SGT